#include <stdio.h>
#include <locale.h> //містить прототип setlocale() для локалізації

#define nUKR 33 //потужність абетки

void encrypt (int n) //оголошення функції шифрування
{
    int marker; //оголошення змінної типу int
    char c; //оголошення змінної типу char
    FILE *fp1, *fp2; //оголошення файлів
    fopen_s(&fp1, "in-text.txt", "r"); //відкриває файл у режимі читання
    fopen_s(&fp2, "out-text.txt", "w"); //відкриває файл для запису
    c = getc(fp1); //присвоює змінній с наступний символ файлу fp1
    while (!feof(fp1)) //цикл з передумовою, який виконується, поки файл не буде пройдений повністю //feof - контролює показник положення у файлі
    {
        marker = 0; //ініціалізація змінної
        if (c>='А' && c<- 'Я')//умова перевірки символу на велику літеру
        {
            c = c + (n % nUKR); //присвоєння до змінної с //кодування літери
            if (c > 'Я') c = 'А' + (c - 'Я') - 1; //перевірка на те, що символ не входить до складу алфавіту
            fprintf (fp2, "$%c", c); //записує змінну у файловий поток
            marker = 1; //ініціалізація змінної
        }
        if (!marker) fprintf(fp2, "%c", c); //перевірка на те, чи був закодований символ
        c = getc(fp1); //присвоює змінній с наступний символ файлу fp1
    }
    printf ("\aКодування відбулося успішно. Зашифрований текст - у out-text.txt.\n"); //виводить текст у консоль
    fclose(fp1); //закриває файл
    fclose(fp2); //закриває файл
}

void decipher (int n) //оголошення функції дешифрування
{
    int marker; //оголошення змінної
    char c; //оголошення змінної
    FILE *fp1 = fopen("out-text.txt", "r"); //відкриває файл у режимі читання
    FILE *fp2 = fopen("in-text.txt", "w"); //відкриває файл для запису
    c = getc(fp1); //присвоює змінній с наступний символ файлу fp1
    while (!feof(fp1)) //цикл з передумовою, який виконується, поки файл не буде пройдений повністю //feof - контролює показник положення у файлі
    {
        marker = 0; //ініціалізація змінної
        if (c>= 'А' && c<='Я') //перевірка на те, що символ входить до заданого проміжку
        {
            c = c - (n % nUKR); //проводить операцію над змінною с
            if (c< 'а') c = 'я' - ('а' - c) + 1;  //перевірка на те, що символ являється нижнім регістром
            fprintf(fp2, "%c", c); //записує змінну у файловий поток
            marker = 1; //ініціалізація змінної
        }
        if (!marker) fprintf(fp2,"%c", c); //перевірка на те, чи був закодований символ
        c = getc(fp1); //присвоює змінній с наступний символ файлу fp1
    }
    printf ("\aДекодування відбулося успішно. Розшифрований текст у in-text.txt.\n"); //виводить текст у консоль
    fclose(fp1); //закриває файл
    fclose(fp2); //закриває файл
}
int main(void)
{
    char *locale = setlocale(LC_ALL, ""); //локалізація консолі
    int k; //оголошує змінну
    char c; //оголошує змінну
    printf ("Шифр Цезаря\nУведіть значення ключа k: "); //виводить текст у консоль
    scanf("%d",&k); //зчитує текст з консолі
    getchar (); //повертає символи з консолі
    if(k>=1) //операнд умови
    {
        printf("Зашифрувати текст у in-text.txt? (Y\N)"); //виводить текст у консоль
        scanf("%c", &c); //зчитує текст з консолі
        getchar (); //повертає символи з консолі
        if (c == 'Y' || c == 'y') encrypt(k); //якщо відповідь користувача "так", то викликати функцію шифрування
        printf("Дешифрувати текст з out-text.txt? (Y\N)"); //виводить текст у консоль
        scanf("%c", &c); //зчитує текст з консолі
        if (c == 'Y' || c == 'y') decipher(k); //якщо відповідь користувача "так", то викликати функцію дешифрування
    }
    return 0; //кінець програми
}
